blog/app/views/articles/_form.html.erb

SELECT "attachments".* FROM "attachments" WHERE "attachments"."article_id" = ?  [["article_id", 4]]
SELECT COUNT(*) FROM "attachments" WHERE "attachments"."article_id" = ?  [["article_id", 16]]
---
  <p>
    <% if !@article.attachments.empty? %>