blog/app/views/articles/show.html.erb

<h1> <%= @article.title%> </h1>
<% @article.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."article_id" = ?  [["article_id", 14]]

<p>
  <% @article.attachments.each do |attachment| %>
---
SELECT "attachments".* FROM "attachments" WHERE "attachments"."article_id" = ?  [["article_id", 5]]