blog/app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "articles" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "keep_calm_rock.png"], ["image_file_size", 12231], ["image_updated_at", "2015-11-29 22:14:57.240616"], ["updated_at", "2015-11-29 22:14:57.250318"], ["id", 5]]