private-events/app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT "events".* FROM "events" WHERE (at_date: < '2018-02-24')

  def create
    @event = current_user.created_events.new(event_params)
---
INSERT INTO "events" ("at_date", "description", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?)  [["at_date", "2018-03-12"], ["description", "TESTEEDFSFSFSFSAF"], ["created_at", "2018-02-22 02:12:42.286744"], ["updated_at", "2018-02-22 02:12:42.286744"], ["creator_id", 1]]

  def show
    @event = Event.find(params[:id])
    accepted_invites = @event.invitations.where(accepted: true)
    @attendees = accepted_invites.map {|invite| User.find_by(id: invite.attendee_id)}
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]