private-events/app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(name: params[:session][:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "francisco"], ["LIMIT", 1]]