private-events/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "fulano"], ["created_at", "2018-02-21 01:41:58.677796"], ["updated_at", "2018-02-21 01:41:58.677796"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    if signed_in?
      @user = User.find(params[:id])
      @events = @user.created_events
      @past_events = @events.previous_events
      @future_events = @events.upcoming_events
      @invites = []
      @user.invitations.each do |invite|

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create_invite
    people_ids = params[:people_invited]
    if people_ids.any?
      people_ids.each do |id|
        person_invited   = User.find(id)
        invited_to_event = Event.find(params[:event_id])

SELECT  "invitations".* FROM "invitations" WHERE "invitations"."attendee_id" = ? AND "invitations"."attendee_id" = ? LIMIT ?  [["attendee_id", 3], ["attendee_id", 3], ["LIMIT", 1]]
UPDATE "invitations" SET "accepted" = ?, "updated_at" = ? WHERE "invitations"."id" = ?  [["accepted", "t"], ["updated_at", "2018-02-26 23:25:58.112687"], ["id", 1]]
---
  def accept_invite
    e = current_user.invitations.find_by(attendee_id: current_user.id)
    if e.update(accepted: params[:accepted])