private-events/app/views/events/index.html.erb

<h1>Upcoming Events</h1>
<% @events.upcoming_events.each do |event| %>
---
SELECT "events".* FROM "events" WHERE (at_date: < '2018-02-24')